interface FAQ {
  question: string;
  answer: string;
}

export const faqList: FAQ[] = [
  {
    question: "어떻게 개발에 입문하게 되었는가?",
    answer:
      "유튜브 영상을 시작으로 흥미가 점점 커져서 부트캠프 교육을 거쳐서 프론트 엔드 개발에 입문하게 되었습니다. 이후 각종 서적을 바탕으로 개발에 전박적으로 필요한 지식들을 하나씩 채워나갔으며, 현재는 알고리즘 과 프론트엔드에 집중하고 있습니다.",
  },
  {
    question: "개발을 배우기 위해 어떤 노력을 하였는가?",
    answer:
      "관심 있는 특정 지식에 대해서는 관련 서적을 폭넓게 읽는 편이다. 개발자가 모든 도구를 직접 경험하고 비교하면 좋겠지만, 현실적으로는 불가능하다. 따라서 모든 도구를 경험하기보다는 내가 필요한 도구를 선정하고, 관련 도구들의 차이점을 간접적으로 비교하여 선택하는 것이 현실적이라고 생각한다. 이 과정속에서 책이 내가 알고자 하는 부분 이외에도 인지하지 못했던 부분까지 같이 학습하게 되어서 책으로 학습하는 것을 선호한다.",
  },
  {
    question: "어떤 개발자가 되고 싶은가?",
    answer: "",
  },
];

export const memoConfig = [
  {
    top: 20,
    left: 1,
  },
  {
    top: 20,
    left: 3,
  },
  { top: 0, left: 1 },
];
